Repository: epiverse-trace/cleanepi
Catalog: po/R-*.po
Languages: fr

source: Found the following unrecognised column name{?s}: {.field {target_columns[missing_cols]}}.
fr: L{?a/es} colonne{?s} suivante{?s} {?est/sont} invalide{?s} : {.field {target_columns[missing_cols]}}.

source: Insufficient number of columns to compare.
fr: Le nombre de colonne à comparer est insuffisant.

source: At least two columns of type {.cls Date} are required for this operation.
fr: Cette opération nécessite au moins deux noms de colonnes de type {.cls Date}.

source: Have you provided an invalid column name?
fr: Avez-vous fourni un nom de colonne incorrect ?

source: Impossible to check the sequence of the date events due to missing values.
fr: Impossible de vérifier la séquence des dates à cause des données manquantes.

source: Cannot check the sequence of date events across {.val {sum(is.na(order_date))}} rows due to missing data.
fr: La séquence des dates ne peut pas être vérifiée à travers {.val {sum(is.na(order_date))}} lignes à cause des données manquantes.

source: No incorrect date sequence was detected.
fr: Aucune séquence de date invalide n'a été détectée.

source: Detected {.val {length(bad_order)}} incorrect date sequence{?s} at line{?s}: {.val {toString(bad_order)}}.
fr: {.val {length(bad_order)}} séquence{?s} de dates invalide{?s} {?a/ont} été détectée{?s} à {?la/aux} ligne{?s} suivante{?s}: {.val {toString(bad_order)}}.

source: Enter {.code print_report(data = dat, "incorrect_date_sequence")} to access them, where {.val dat} is the object used to store the output from this operation.
fr: Veuillez entrer {.code print_report(data = dat, "incorrect_date_sequence")} pour y accéder. {.val dat} represente ici l’object créé pour stocker le résultat de cette opération.

source: Cleaning column names
fr: Nettoyage des noms de colonnes

source: Replacing missing values with NA
fr: Remplacement des valeurs manquantes par NA

source: Removing constant columns and empty rows
fr: Suppression des colonnes invariables, des lignes et colonnes vides

source: Removing duplicated rows
fr: Suppression des lignes redondantes

source: Standardizing Date columns
fr: Standardisation des colonnes de type Date

source: Checking subject IDs format
fr: Vérification du format de la colonne contenant l’identifiant des individus

source: You must specify the name of the column that uniquely identifies the individuals via the {.emph target_columns} argument.
fr: Vous devez fournir le nom de la colonne avec les identifiants des individus à travers l’argument {.emph target_columns}.

source: Type {.code ?check_subject_ids} to see the help on the corresponding function.
fr: Veuillez entrer {.code ?check_subject_ids} pour plus d’information sur la function correspondante.

source: Converting the following {cli::qty(length(target_columns))} column{?s} into numeric: {.field {toString(target_columns)}}
fr: Convertion {cli::qty(length(target_columns))} {?de la/des} colonne{?s} suivante{?s} en numérique: {.field {toString(target_columns)}}

source: Performing dictionary-based cleaning
fr: Substitution de valeurs via dictionnaire des données

source: Checking whether date sequences are respected
fr: Vérification de la séquence des dates

source: No character column found from the input data.
fr: Aucune colonne avec des valeurs de type chaîne de caractères n’a été identifiée.

source: Found {.cls numeric} values that can also be of type {.cls Date} in the following {cli::qty(length(ambiguous_cols))} column{?s}: {.field {toString(ambiguous_cols)}}.
fr: Des valeurs de type {.cls numérique} pouvant aussi être de type {.cls Date} ont été identifiées dans {cli::qty(length(ambiguous_cols))} {?la/les} colonne{?s} suivante{?s}: {.field {ambiguous_cols}}.

source: They can be converted into {.cls Date} using: {.code lubridate::as_date(x, origin = as.Date("1900-01-01"))}
fr: Veuillez utiliser {.code lubridate::as_date(x, origin = as.Date("1900-01-01"))} pour les convertir en {.cls Date}

source: where {.val x} represents here the vector of values from the corresponding column ({.code data$target_column}).
fr: où {.val x} représente le vecteur des valeurs issues de la colonne cible correspondante ({.code data$target_column}).

source: Cannot rename {cli::qty(length(incorrect_col_names))} {?an/ } unrecognised column name{?s} specified in {.emph rename} argument: {.val {toString(incorrect_col_names)}}.
fr: Impossible de renommer {cli::qty(length(incorrect_col_names))} {?la/les} colonne{?s} fournie{?s} à l’argument {.emph rename}, mais qui n’existe{?nt} pas: {.val {toString(incorrect_col_names)}}.

source: Make sure that the columns to be renamed are part of the input data.
fr: Assurez-vous que toutes les colonnes à renommer fassent parti des données d’entrée.

source: To rename columns, use: {.emph rename = c(new_name1 = 'old_name1', new_name2 = 'old_name2')}.
fr: Les noms de colonnes peuvent être renommer comme suit: {.emph rename = c(nouveau_nom1 = 'ancien_nom1', nouveau_nom2 = 'ancien_nom2')}.

source: The provided replace column {cli::qty(length(existing_cols))} name{?s} already exist.
fr: {cli::qty(length(existing_cols))} Le{?s} nom{?s} utilisé{?s} pour renommer {?une des/certaines} colonnes existe{?nt} déjà.

source: All new names must be different from existing column names.
fr: Tout nouveau nom doit être différent des noms qui existent déjà.

source: You must use {cli::qty(length(existing_cols))} {?a/ } different name{?s} for the following column{?s}: {.field {toString(existing_cols)}}.
fr: Vous devez fournir {cli::qty(length(existing_cols))} {?un/des} nom{?s} différent{?s} pour {?la/les} colonne{?s} suivante{?s} : {.field {toString(existing_cols)}}.

source: Automatic detection of columns to convert into numeric failed.
fr: Impossible de détecter automatiquement les colonnes à convertir en numérique.

source: No character column with numeric values found by {.fn scan_data}.
fr: Aucune colonne de type chaîne de caractères (character) contenant des valeurs numériques n’a été identifiée par {.fn scan_data}.

source: Please specify names of the columns to convert into numeric using {.emph target_columns}.
fr: Veuillez spécifier les noms des colonnes à convertir en numérique à travers l’argument {.emph target_columns}.

source: Found one or more columns with insuffisient numeric values for automatic conversion.
fr: Des colonnes avec un nombre insuffisant de valeurs numériques ont été identifiées.

source: The percentage of character values must be less than twice the numeric values for a column to be considered for automatic conversion.
fr: Le pourcentage de valeurs de type chaîne de caractères doit faire moins du double de celui des valeurs numériques pour qu’une colonne soit automatiquement convertie.

source: Found {.val {num_values}} numeric value{?s} in {.field {col}}.
fr: {.val {num_values}} valeur{?s} de type numérique {?a/ont} été identifiée{?s} dans la colonne: {.field {col}}.

source: Please consider the following options:
fr: Veuillez considérer les options suivantes :

source: Converting characters into numeric
fr: Convertir les chaînes de caractères en numériques

source: Replacing the numeric values by {.val NA} using the {.fn replace_missing_values} function.
fr: Remplacer les valeurs numériques avec {.val NA} via la fonction {.fn replace_missing_values}.

source: The following column{?s} will be converted into numeric: {.field {to_numeric}}.
fr: {?La/Les} colonne{?s} suivante{?s} {?sera/seront} convertie{?s} en numérique : {.field {to_numeric}}.

source: {.emph {toString(data[[col]][multi_match_idx])}} matched equally multiple words in the {.strong wordlist}
fr: {.emph {toString(data[[col]][multi_match_idx])}} correspond syntaxiquement à plusieurs mots dans {.strong wordlist}

source: Using the first matched word in the {.strong wordlist}.
fr: Le premier mot le correspondant a été utilisé.

source: {.field {col}} is not a {.cls character} column so cannot be spell checked.
fr: Impossible de vérifier l'orthographe des valeurs de la colonne {.field {col}} étant donné qu'elle n'est pas de type {.cls caractère}.

source: Unexpected format in the function arguments.
fr: Le format des valeurs fournies aux arguments de la fonction est invalide.

source: {.emph first_date} and {.emph last_date} must be of type {.cls Date} or {.cls character} written in {.emph ISO8601} format ('2024-12-31' for December 31, 2024).
fr: {.emph first_date} et {.emph last_date} doivent être de type {.cls Date} ou {.cls chaîne de caractères (character)} au format {.emph ISO8601} ('2024-12-31' pour 31 Décembre 2024).

source: {.field {cols}} cannot be converted into {.cls Date} due to:
fr: {.field {cols}} ne peut pas être converti en{.cls Date} pour les raisons suivantes:

source: insuffisient {.cls Date} values
fr: nombre insuffisant de valeurs de type {.cls Date}

source: or a high number of values that are outside the specified time frame.
fr: ou bien la majorité des valeurs est en dehors de l'interval de temps défini dans {.field timeframe}

source: Expected values with the same format.
fr: Les valeurs devaient avoir le même format.

source: You've tried to convert values in different formats into {.cls Date}.
fr: Vous avez essayé de convertir en {.cls Date} des valeurs ayant differents formats.

source: Please specify the formats encountered in your column of interest via the {.emph format} argument.
fr: Veuillez fournir les formats retrouvés dans la colonne cible via le paramètre {.emph format}.

source: Unexpected data type provided to {.fn date_guess} function.
fr: Le type de donnée fourni à la fonction {.fn date_guess} est différent du type que la fonction devait prendre.

source: You can convert the values into {.cls character} to enable format guessing.
fr: Vous pouvez convertir les valeurs en {.cls chaîne de caractères (character)} pour permettre la détection automatique de leurs formats.

source: You've tried to guess the date format from values of type other than Date and character.
fr: Vous avez tenté de détecter le format de valeurs qui ne sont ni de type Date ou chaîne de caractères.

source: Unable to match formats to target columns.
fr: Impossible d’établir la correspondence entre formats et colonnes ciblées.

source: The number of target columns does not match the number of specified formats.
fr: Le nombre de colonnes cibles ne correspond pas au nombre de formats qui sont forunis

source: Only one format is needed if all target columns contain values of the same format. Otherwise, one format per target column must be provided.
fr: Seul un format est requis si les colonnes cibles ont des valeurs du même format. Sinon, vous devez fornir un format par colonne cible.

source: The target {cli::qty(length(target_columns))} column{?s} will be standardized using the format: {.val {format}}.
fr: {cli::qty(length(target_columns))}{?La/Les} colonne{?s} cible{?s} {?sera/seront} standardisée{?s} en se basant sur le format suivant : {.val {format}}.

source: Found the following unrecognised {cli::qty(length(extra))} argument{?s} to {.fn clean_data}: {.emph {toString(extra)}}.
fr: {.fn clean_data} ne prend pas {cli::qty(length(extra))} {?l’argument/les arguments} suivant{?s} : {.emph {toString(extra)}}.

source: {.fn clean_data} does not support arguments other than the defaults.
fr: {.fn clean_data} ne prend pas d’arguments autre que ceux qui sont définis par défault.

source: You provided {cli::qty(length(extra))} {?an/ } unexpected argument{?s}.
fr: Vous avez fourni {cli::qty(length(extra))} {?un/des} argument{?s} qui {?est/sont} invalide{?s}.

source: Run {.fn get_default_params} to display the list of default parameters.
fr: Entrez {.fn get_default_params} pour consulter la list des arguments prédéfinis.

source: Incorrect data dictionary format.
fr: Le format du dictionnaire de données est invalide.

source: The value for the {.emph dictionary} argument must be a {.cls data.frame} with the following columns: {.field {toString(all_columns)}}.
fr: La valeur fournie a l’argument {.emph dictionary} doit être un {.cls data.frame} contenant les colonnes suivantes: {.field {toString(all_columns)}}.

source: The following columns are mandatory: {.field {toString(mandatory_columns)}}.
fr: Les colonnes suivantes sont obligatoires : {.field {toString(mandatory_columns)}}.

source: Incorrect column names specified in column {.field grp} of the data dictionary.
fr: La colonne {.field grp} du dictionnaire de données contient des noms de colonnes invalides.

source: Values in {.field grp} column of the data dictionary must be found in the input data frame.
fr: Les noms de colonnes fournies dans la colonne {.field grp} du dictionnaire de données doivent figurer dans le tableau des données d’entrée (data frame).

source: Did you enter an incorrect column name?
fr: Avez-vous fourni un nom de colonne invalide ?

source: You can either:
fr: Vous pouvez soit :

source: correct the misspelled {cli::qty(length(misspelled_options))} option{?s} from the input data, or
fr: corriger {cli::qty(length(misspelled_options))} {?l’option/les options} mal orthographiée{?s}, ou

source: add {cli::qty(length(misspelled_options))} {?it/them} to the dictionary using the {.fn add_to_dictionary} function.
fr: {cli::qty(length(misspelled_options))} {?l’ajouter/les ajouter} au dictionnaire de données en utilisant la fonction {.fn add_to_dictionary}.

source: Cannot replace {.val {toString(undefined_opts)}} present in column {.field {option}} but not defined in the dictionary.
fr: Impossible de remplacer: {.val {toString(undefined_opts)}}, qui se {cli::qty(undefined_opts)} {?trouve/trouvent} dans la colonne {.field {option}} et non définis dans le dictionnaire de données.

source: Found {.val {nrow(dups)}} duplicated row{?s} in the dataset.
fr: Ces données contiennent {.val {nrow(dups)}} ligne{?s} redondante{?s}.

source: Use {.code print_report(dat, "found_duplicates")} to access them, where {.val dat} is the object used to store the output from this operation.
fr: Veuillez entrer {.code print_report(dat, "found_duplicates")} pour y accéder. {.val dat} represente ici l’object créé pour stocker le résultat de cette opération.

source: No duplicates were found.
fr: Aucune ligne redondante n’a été détectée.

source: Incorrect value provided to the {.emph order} argument.
fr: La valeur fournie à l’argument {.emph order} est invalide.

source: Value for {.emph order} argument must be either a {.cls character} or a {.cls list} of character vectors.
fr: L’argument {.emph order} prend comme valeur un {.cls vecteur} de chaînes de caractères ou une {.cls liste} d’un ou plusieurs vecteurs de chaînes de caractères.

source: The {.pkg reactable} package is required for printing the report.
fr: Vous devez installer la librairie {.pkg reactable} pour visualiser le rapport du nettoyage des données.

source: No report associated with the input data.
fr: Pas de rapport associé à ce tableau de données.

source: At least one data cleaning operation must be applied to the data before calling {.fn print_report}.
fr: Au moins une opération de nettoyage de données doit être appliquée aux données avant d’évoquer la fonction {.fn print_report}.

source: The list of functions in {.pkg cleanepi} can be found at: {.url https://epiverse-trace.github.io/cleanepi/reference/index.html}.
fr: Veuillez consulter la liste des fonctions disponibles dans {.pkg cleanepi} à travers le lien suivant : {.url https://epiverse-trace.github.io/cleanepi/reference/index.html}.

source: Incorrect value provided for {.emph format} argument!
fr: La valeur fournie à l’argument {.emph format} est invalide.

source: Only {.val html} format is currently supported.
fr: Seul le format {.val html} est accepté pour le moment.

source: Generating html report in {.file {temp_dir}}.
fr: Creation du rapport en format html dans {.file {temp_dir}}.

source: Constant data was not removed. The value for the {.emph cut-off} argument must be greater than {.emph 0} and less than or equal to {.emph 1}.
fr: Les données constantes n'ont pas été supprimées. La valeur de l'argument {.emph cut-off} doit être supérieure à {.emph 0} et inférieure ou égale à {.emph 1}.

source: Constant data was removed after {.val {nrow(constant_data_report)}} iteration{?s}.
fr: Les données constantes ont été supprimées après {.val {nrow(constant_data_report)}} iteration{?s}.

source: Enter {.code print_report(dat, "constant_data")} for more information, where {.val dat} represents the object used to store the output from {.fn remove_constants}.
fr: Veuillez entrer {.code print_report(dat, "constant_data")} pour plus d’information. {.val dat} represente ici l’object créé pour stocker le résultat de la fonction {.fn remove_constants}.

source: Could not detect the provided missing value {cli::qty(length(na_strings))} character{?s}.
fr: Impossible de détecter {cli::qty(length(na_strings))} {?la/les} chaîne{?s} de caractères représentant les valeurs manquantes.

source: Does your data contain missing value characters other than the specified ones?
fr: Vos données contiennent-elles d’autres chaînes de caractères utilisées pour représenter les valeurs manquantes ?

source: Unexpected type in the value for argument {.emph end_date}.
fr: Le type de la valeur de l’argument {.emph end_date} est invalide.

source: You provided a name of a column of type {.cls {class(data[[end_date]])}}.
fr: Vous avez fourni le nom d’une colonne de type {.cls {class(data[[end_date]])}}.

source: The value for {.emph end_date} argument must be of type {.cls Date} in {.emph ISO8601} format.
fr: La valeur de l’argument {.emph end_date} doit être de type {.cls Date} dans un format {.emph ISO8601}.

source: Detected {.val {cli::no(num_multi_format_dates)}} value{?s} that {cli::qty(num_multi_format_dates)} compl{?ies/y} with multiple formats and {.val {cli::no(num_outsiders)}} value{?s} that {cli::qty(num_outsiders)} {?is/are} outside of the specified time frame.
fr: Il y a {.val {cli::no(num_multi_format_dates)}} valeur{?s} qui qty(num_multi_format_dates)} peu{?t/vent} avoir plusieurs formats and {.val {cli::no(num_outsiders)}} valeur{?s} qui {cli::qty(num_outsiders)} {?est/sont} en dehors de l'interval de temps défini dans {.field timeframe}.

source: Enter {.code print_report(data = dat, "date_standardization")} to access {cli::qty(num_multi_format_dates)} {?it/them}, where {.val dat} is the object used to store the output from this operation.
fr: Veuillez entrer {.code print_report(data = dat, "date_standardization")} pour y accéder. {.val dat} represente ici l’object créé pour stocker le résultat de cette opération.

source: Found {.cls numeric} values that could also be of type {.cls Date} in {cli::qty(length(ambiguous_cols))} column{?s}: {.field {toString(ambiguous_cols)}}.
fr: Des valeurs de type {.cls numérique} pouvant aussi être de type {.cls Date} ont été identifiées dans {cli::qty(length(ambiguous_cols))} {?la/les} colonne{?s} suivante{?s}: {.field {ambiguous_cols}}.

source: It is possible to convert them into {.cls Date} using: {.code lubridate::as_date(x, origin = as.Date("1900-01-01"))}
fr: Veuillez entrer {.code lubridate::as_date(x, origin = as.Date("1900-01-01"))} pour les convertir en {.cls Date}.

source: where {.val x} represents here the vector of values from these columns ({.code data$target_column}).
fr: où {.val x} représente le vecteur des valeurs issues des colonnes cibles ({.code data$target_column}).

source: No incorrect subject id was detected.
fr: Aucun identifiant invalide n'a été détecté.

source: Detected {.val {num_missing_ids}} missing, {.val {num_duplicated_ids}} duplicated, and {.val {num_invalide_ids - num_missing_ids}} incorrect subject IDs.
fr: Il y a {.val {num_missing_ids}} valeur{?s} manquante{?s}, {.val {num_duplicated_ids}} doublon{?s}, et {.val {num_invalide_ids - num_missing_ids}} identifiant{?s} incorrecte{?s} dans la colonne contenant les identifiants unique des individus.

source: Enter {.code print_report(data = dat, "incorrect_subject_id")} to access them, where {.val dat} is the object used to store the output from this operation.
fr: Veuillez entrer {.code print_report(data = dat, "incorrect_subject_id")} pour y accéder. {.val dat} represente ici l’object créé pour stocker le résultat de cette opération.

source: You can use the {.fn correct_subject_ids} function to correct {cli::qty(length(bad_rows))} {?it/them}.
fr: Vous pouvez {cli::qty(length(bad_rows))} le{?s} corriger en utilisant la fonction {.fn correct_subject_ids}.

source: Some IDs specified in the correction table were not found in the input data.
fr: Certains identifiants fournis dans la table de correction ne figurent pas dans les données d’entrée.

source: Values in the {.field from} column of the correction table must be part of the detected incorrect subject IDs.
fr: Les valeurs fournies à la colonne {.field from} de la table de correction doivent être parmi les identifiants incorrects qui ont été détectés.

source: `value` to add to `report` attribute cannot be NULL.
fr: La valeur à ajouter au rapport ne peut pas être NULL.

source: Please specify an object to {.emph value} to be added to {.emph report}.
fr: Veuillez assigner à {.emph value} la valeur ou l'object que vous souhaitez ajouter au rapport.

source: Could not find the following column name{?s}: {.field {target_columns[is.na(idx)]}}
fr: Les données ne contiennent pas le{?s} nom{?s} de colonnes suivant{?s} : {.field {target_columns[missing_cols]}}.

source: Please make sure that all specified target columns belong to the input data.
fr: Assurez-vous que toutes les colonnes cibles fassent parti des données d’entrée.

source: Some column indices are out of bound.
fr: Certains numéros de colonne sont hors de la limite.

source: Column indices must be between {.val {1}} and {.val {ncol(data)}}.
fr: Les numéros des colonnes cibles doivent être compris entre {.val {1}} et {.val {ncol(data)}}.

source: You provided indices for columns that do not exist.
fr: Vous avez fourni des numéros de colonne supérieurs au nombre total de colonnes dans vos données.

source: Invalid value for {.emph target_columns}.
fr: La valeur fournie pour l’argument {.emph target_columns} est incorrecte.

source: {.val linelist_tags} only works on {.cls linelist} objects. You can provide a {.cls vector} of column names for inputs of class {.cls data.frame}.
fr: {.val linelist_tags} doit être utilisé pour des objects de class {.cls linelist} uniquement. Vous pouvez fournir un {.cls vecteur} de noms de colonnes pour les données de class {.cls data.frame}.

source: The specified target columns are either constant or empty.
fr: Les colonnes cibles sont soit constantes ou vides.

source: Please consider using:
fr: Veuillez considérer utiliser :

source: the names of columns that are neither constant or empty, or
fr: des noms de colonnes qui sont ni vides ni constantes, ou bien

source: {.fn remove_constants} prior to this cleaning operation.
fr: la fonction {.fn remove_constants} avant cette opération.
